{
    "intents": [
        {
            "tag": "battery issue",
            "patterns": [
                "Even after charging overnight, my phone battery drops to 20% by noon.",
                "I bought this phone a week ago, and it barely holds charge.",
                "The advertised battery life was 10 hours '97 I get only 3.",
                "Phone heats up and loses battery rapidly during calls.",
                "Why does my brand new phone need to be charged 3 times a day?",
                "I'm charging my phone twice a day even with minimal usage.",
                "Battery goes from 100% to 10% in just a couple of hours.",
                "This battery doesn't last even half a day '97 very disappointing.",
                "I barely use the phone and still the battery doesn't last.",
                "This phone promised 5000mAh battery but doesn't feel like it.",
                "The phone shuts down abruptly even when the battery is at 20%.",
                "I lose 15% battery just while browsing Instagram for 10 mins.",
                "I expected at least a full day of battery, not 4 hours.",
                "The battery drains rapidly while watching videos.",
                "I have to carry a power bank everywhere because this phone won't last.",
                "My phone's battery health is down to 80% in just a month.",
                "The standby battery drain is ridiculously high.",
                "Phone battery depletes even in airplane mode.",
                "I bought this for the advertised long battery life. It's a scam.",
                "The phone battery indicator jumps from 60% to 10% instantly.",
                "I thought 6000mAh would last longer, but it drains too quickly.",
                "The battery percentage drops drastically during calls.",
                "Within a few days of purchase, the battery backup became terrible.",
                "This phone can't even handle basic apps without losing charge.",
                "Even after a full charge, the battery drains on standby.",
                "My phone is dead by 5 PM every day '97 that's not acceptable.",
                "I'm getting only 2 hours screen-on time '97 nowhere near promised.",
                "This isn't even heavy usage '97 battery still doesn't last.",
                "Company claimed 2-day battery backup, I get barely half a day.",
                "Battery backup is far less than what was mentioned on the site.",
                "My battery drops from 80% to 0% in under 10 minutes.",
                "Even messaging causes battery drain on this phone.",
                "The battery is draining faster than my old phone.",
                "I regret buying this model due to battery problems.",
                "It doesn't last even a single online class without dying.",
                "Phone battery life is getting worse every week.",
                "Battery went from bad to worse within 2 weeks of use.",
                "Gaming kills the battery in 30 minutes flat.",
                "Nothing heavy running '97 still losing charge fast.",
                "Was supposed to be a marathon battery. It's not.",
                "The battery icon is unreliable '97 phone shuts off early.",
                "This model's battery is weaker than previous generation.",
                "My old phone lasted longer on the same usage.",
                "Even calls and messages drain the battery rapidly.",
                "I trusted the specs but battery life is just not there.",
                "The battery can't even support standby for 10 hours.",
                "Phone switches off at 15% randomly.",
                "Battery optimization doesn't help '97 still poor backup.",
                "I need to keep a charger around all the time.",
                "This device doesn't give more than 3 hours usage.",
                "Using GPS or camera for 10 mins eats 20% battery.",
                "Battery drain happens even when idle overnight.",
                "It's fully charged in the morning, dead by lunch.",
                "This battery performance is unacceptable for the price.",
                "Every app update seems to worsen the battery.",
                "Brand claimed 6000mAh, but real-life usage says otherwise.",
                "I've tried battery saver, still no improvement.",
                "Even after a software update, battery drain persists.",
                "This phone can't survive a full workday.",
                "I can't rely on this phone because of battery issues.",
                "Charging takes forever and drains quickly.",
                "This is the worst battery I've seen on a smartphone.",
                "Even budget phones have better battery than this.",
                "Mobile dies even with 30% battery showing.",
                "I bought this for long battery life '97 totally misled.",
                "This is clearly a battery defect '97 happens daily.",
                "I have to charge 3 times a day for normal usage.",
                "I feel cheated by the battery claims made by the brand.",
                "I checked with others '97 everyone is facing battery drain.",
                "My battery can't last through a train journey.",
                "I don't even play games and it still drains this fast.",
                "Battery drops even faster when using WiFi.",
                "This phone is unusable without charging multiple times.",
                "The battery drains even faster during video calls.",
                "I charge the phone to 100%, and it's down to 50% in an hour.",
                "The device heats up and drains charge at the same time.",
                "The phone randomly switches off due to battery fault.",
                "Very poor battery optimization on this model.",
                "My phone battery health has dropped to 85% in one month.",
                "Phone barely lasts through one online class.",
                "Battery depletes with basic browsing and calls.",
                "Camera drains the battery massively in 5 mins.",
                "Heavy standby battery consumption is unacceptable.",
                "This is not what was advertised in terms of backup.",
                "After-sales said this is 'normal' but clearly it's not.",
                "My backup is barely 3 hours '97 shocking for this price.",
                "Battery problem started just a week after delivery.",
                "I'm forced to carry a power bank all day now.",
                "The battery graph shows rapid dips even at idle.",
                "My expectations were high '97 this battery failed me.",
                "Charging every 5 hours is too much for a new phone.",
                "Battery drains even faster during multitasking.",
                "This is not a 5000mAh experience by any standard.",
                "I feel scammed '97 battery life is way below promise.",
                "This mobile can't support even 3 hours of use.",
                "My phone's battery was great for a week '97 then dropped.",
                "Power saving mode barely makes a difference.",
                "This phone's battery is dead weight."
            ],
            "responses": [
                "battery issue"
            ]
        },
        {
            "tag": "delivery delay",
            "patterns": [
                "My phone hasn't been delivered even after 10 days.",
                "I ordered a phone and the delivery is still pending.",
                "It's been a week and I still haven't received my phone.",
                "The delivery date keeps changing every day.",
                "My package is stuck in transit with no updates.",
                "Flipkart keeps delaying the delivery of my phone.",
                "I ordered on the 1st, it's the 15th and nothing has arrived.",
                "No update on the shipment since 4 days.",
                "It shows 'out for delivery' but no one has come.",
                "The phone I ordered was supposed to arrive 5 days ago.",
                "I'm tired of waiting for my delayed order.",
                "They promised next-day delivery but it's been 5 days.",
                "My phone is showing 'in transit' for a week now.",
                "Delivery was scheduled for Monday, still nothing.",
                "There's no proper tracking for my phone delivery.",
                "I have not received my mobile yet, even after full payment.",
                "My order keeps getting rescheduled.",
                "The delivery boy didn't show up and marked it as failed.",
                "I needed this phone urgently but it's not here.",
                "They keep changing the estimated delivery date.",
                "My order has been delayed without any reason.",
                "The item was dispatched but never arrived.",
                "I didn't get any call from the delivery person.",
                "It's been more than a week with no delivery attempt.",
                "The app says delivered but I didn't receive anything.",
                "The delivery was marked complete fraudulently.",
                "My order was delayed multiple times without explanation.",
                "I was told I'd get my phone yesterday, still waiting.",
                "The order is lost and customer service is unhelpful.",
                "It's stuck with the courier company for several days.",
                "I've been tracking it daily '97 no movement at all.",
                "There's no sign of my package arriving soon.",
                "The status hasn't changed from 'shipped' for 6 days.",
                "Expected delivery date passed and no update.",
                "The delay is affecting my work and studies.",
                "I stayed home for delivery, no one came.",
                "No delivery attempt was made despite multiple promises.",
                "Every time I call, they give me a new date.",
                "The platform says 'wait 24 hours' '97 every day.",
                "Why hasn't my phone been delivered yet?",
                "My order has not moved since dispatch.",
                "It says 'arrived at facility' but is stuck there.",
                "Order delayed without any explanation from the seller.",
                "I was promised same-day delivery '97 didn't happen.",
                "Delays like this are unacceptable for prepaid orders.",
                "I've already complained twice, still no delivery.",
                "The estimated delivery window has long passed.",
                "Courier service is giving false delivery updates.",
                "My order was scheduled but returned without reason.",
                "I've been waiting for this phone for two weeks.",
                "Seller shipped the item but it's not moving.",
                "The tracking number is invalid or shows no activity.",
                "Courier partner is not responding about the package.",
                "Delivery agent marked it 'refused by customer' '97 false.",
                "I stayed available at home but still missed delivery.",
                "My product is stuck at the local hub.",
                "Status says delayed due to operational issue.",
                "Product delayed due to unknown logistics issue.",
                "The item hasn't even been picked up yet.",
                "Nobody is updating me about the delay.",
                "I was not informed about any delay officially.",
                "The product was supposed to arrive 3 days ago.",
                "I received everything else except my phone.",
                "My order is taking too long to arrive.",
                "I'm tired of checking the app for tracking updates.",
                "It shows expected delivery today '97 but no sign yet.",
                "There is a long delay and no compensation offered.",
                "Can I cancel this delayed delivery?",
                "Why is there no ETA for my phone?",
                "Tracking says it was out for delivery 2 days ago.",
                "The delivery date has changed 4 times already.",
                "It's frustrating to wait without any communication.",
                "My order hasn't been delivered but marked dispatched.",
                "The delivery person didn't even call.",
                "Delivery is stuck due to 'route issue' '97 what is that?",
                "No SMS or call from the delivery guy.",
                "Delay is happening even though the product is in my city.",
                "My shipment was marked undeliverable for no reason.",
                "Why does it take 10+ days for a metro city delivery?",
                "The package arrived at nearby hub and is stuck.",
                "My delivery attempt failed without anyone showing up.",
                "I'm not getting any support for the delay.",
                "Order is stuck on 'pending delivery' for 5 days.",
                "Courier says it's delivered, but I didn't get it.",
                "Why was my delivery rescheduled automatically?",
                "The order was out for delivery but returned.",
                "Delivery failed twice even though I was home.",
                "This delay is unacceptable for a high-value order.",
                "The tracking keeps resetting to previous stage.",
                "No one contacted me for delivery update.",
                "My order is stuck between hubs.",
                "Delay happened even with Prime delivery.",
                "This is the 3rd time they rescheduled the delivery.",
                "The delivery was attempted at the wrong address.",
                "I can't contact the delivery agent directly.",
                "The package is in my city but no one is delivering it.",
                "Delivery is pending for more than 12 days.",
                "Seller is not helping with delayed delivery.",
                "They say they'll call back '97 they never do.",
                "Product has not arrived but status says delivered.",
                "The tracking says 'delayed due to weather' '97 it's clear.",
                "My order was returned to warehouse without a call.",
                "I keep getting fake delivery attempt messages.",
                "Nobody knows where my phone is right now.",
                "Shipping company says product is missing.",
                "The product is in the wrong city.",
                "Support says the issue is being escalated '97 nothing happens."
            ],
            "responses": [
                "delivery delay"
            ]
        },
        {
            "tag": "fake/different product",
            "patterns": [
                "I ordered an original iPhone and received a fake replica.",
                "The phone I received is a different model than what I ordered.",
                "I ordered a Samsung Galaxy and received some unknown Chinese brand.",
                "Instead of a new phone, I got a visibly used device.",
                "The phone has scratches and fingerprints '97 definitely not new.",
                "The box says OnePlus but the phone inside is not OnePlus.",
                "I ordered a phone in black, but they sent a blue one.",
                "I received an entirely different product from what was listed.",
                "The seal on the box was already broken when I received it.",
                "There was no charger or accessories in the box as mentioned.",
                "The phone I got does not match the specs shown on the website.",
                "This is clearly a refurbished phone '97 not brand new.",
                "I received a phone without a valid IMEI number.",
                "The packaging is completely different from the brand's original packaging.",
                "I got a fake phone with no brand logo.",
                "I ordered a 6GB RAM model, but received the 4GB variant.",
                "They sent me a phone with Chinese language settings only.",
                "My phone doesn't support Indian SIM '97 this isn't an Indian version.",
                "I received a demo phone instead of a retail one.",
                "The phone has fake labels and doesn't feel authentic.",
                "I got a phone with no warranty card or manual.",
                "The invoice doesn't match the phone details.",
                "This is a copy product '97 not the original I paid for.",
                "I received a damaged and already activated device.",
                "I ordered a sealed pack phone '97 got an open box instead.",
                "I got a different color and storage option than selected.",
                "I received earbuds instead of a smartphone.",
                "Phone had another person's account logged in '97 definitely not new.",
                "The phone I received doesn't match the listing images.",
                "There's no serial number on the device packaging.",
                "The features don't match the specifications on the site.",
                "I ordered a flagship phone and got an entry-level model.",
                "This phone seems like a counterfeit '97 even the logo looks fake.",
                "I got a phone with a different IMEI than what's mentioned on the box.",
                "There's no bill inside the box '97 looks like a grey market unit.",
                "The logo on the phone is peeling off '97 seems like a cheap copy.",
                "This doesn't look like the brand's original packaging at all.",
                "I received an imported phone with no Indian charger.",
                "Phone has duplicate software UI '97 not the real brand.",
                "Camera quality is not as advertised '97 feels like a fake unit.",
                "The device was already set up when I opened it.",
                "I got an older model when I paid for the latest one.",
                "They sent a refurbished unit disguised as new.",
                "Even the warranty check shows this phone was already activated.",
                "This is not a genuine product '97 completely different build.",
                "The brand logo is misplaced and looks off.",
                "I ordered from a verified seller, still got a different model.",
                "Got a global variant instead of Indian model '97 no support here.",
                "Phone looks like a dummy or display piece.",
                "This unit is tampered '97 seals removed and repacked.",
                "I opened the box and found a completely different phone.",
                "This is not the same product shown on the app.",
                "The memory configuration doesn't match what I selected.",
                "The accessories inside the box are of another brand.",
                "The phone has a used SIM tray and scratches inside.",
                "This phone was clearly used before '97 it has data on it.",
                "Fingerprint sensor doesn't work '97 seems like a dummy sensor.",
                "The phone looks like a clone device, not original.",
                "I received a phone with duplicate operating system.",
                "Phone box says 5G but device supports only 4G.",
                "The screen resolution is poor '97 not as per specs.",
                "This phone has a different processor than mentioned.",
                "Even the camera count is wrong '97 I paid for triple lens.",
                "Phone says made in China instead of India '97 not what was listed.",
                "I got a counterfeit product '97 even the fonts are wrong.",
                "Phone has stickers covering missing branding.",
                "I found the same fake phone being sold cheaper elsewhere.",
                "The phone stopped working on day 1 '97 seems like fake.",
                "The seller changed the listing after my order.",
                "They replaced the phone with a duplicate during delivery.",
                "Barcode is tampered '97 can't verify authenticity.",
                "The screen looks like a copy '97 low quality display.",
                "This is not a genuine item '97 even the weight feels different.",
                "Received a Chinese clone instead of original brand.",
                "Received a device with a fake charger and cable.",
                "The accessories are not of the same brand as the phone.",
                "I paid for a brand-new product but received a used phone.",
                "They sent me a phone with broken seal and smudges.",
                "My device is not recognized by the official brand app.",
                "Product doesn't match its online description.",
                "I received a wrong brand altogether.",
                "Wrong RAM/ROM combination received in phone.",
                "Device came with someone else's ID logged in.",
                "The phone packaging was completely different than what was advertised.",
                "This phone doesn't feel original '97 performance is poor.",
                "App showed original phone, but I got a cheap copy.",
                "The product smells of plastic '97 doesn't feel real.",
                "They sent an international version with no warranty.",
                "This isn't a new phone '97 battery health already low.",
                "Phone has wrong branding '97 clearly a fake.",
                "The build quality doesn't feel like the original brand.",
                "Received a dummy phone that doesn't switch on.",
                "All accessories are fake '97 not even matching the phone.",
                "The phone box had a different product code altogether.",
                "They repackaged a used phone and sent it as new.",
                "The seller changed the brand name on the product manually.",
                "Even the user manual is not in English '97 clearly fake.",
                "I paid for a new phone '97 received a customer return.",
                "My device has no certification sticker on it.",
                "They sent a different variant with lower specs."
            ],
            "responses": [
                "fake/different product"
            ]
        },
        {
            "tag": "refund issue",
            "patterns": [
                "I returned my phone but haven't received the refund yet.",
                "The refund was approved but the amount hasn't been credited.",
                "I haven't received my money after returning the product.",
                "My refund is stuck in processing for over a week.",
                "The status shows refund completed, but I didn't get any money.",
                "It's been 10 days and my refund hasn't been issued.",
                "They said I'll get a refund in 3 days '97 it's already a week.",
                "Customer care keeps delaying my refund.",
                "The refund process was started but I still don't have the money.",
                "I paid online but haven't been refunded after return.",
                "My refund hasn't reached my bank account yet.",
                "The amount is missing even though refund status is 'successful'.",
                "The company is not processing the refund even after pickup.",
                "They collected the returned phone but no refund received.",
                "I've raised multiple tickets for refund '97 no response.",
                "The refund link expired before I could claim it.",
                "I got a damaged phone, returned it, but refund hasn't come.",
                "They promised refund within 7 days '97 it's been 15.",
                "I cancelled the order before shipping, still no refund.",
                "Return was successful but refund was never issued.",
                "My refund has been 'initiated' for over 2 weeks now.",
                "The delivery guy confirmed return but the refund is pending.",
                "I received a refund confirmation message but no money.",
                "They keep saying 'wait 24 hours' for refund every day.",
                "My bank hasn't received any refund despite confirmation.",
                "The return was processed last week, still waiting for refund.",
                "I got a partial refund instead of full amount.",
                "Refund has been credited to the wrong account.",
                "I got a voucher instead of refund without my consent.",
                "The company is denying my refund request unfairly.",
                "I paid through UPI but refund hasn't reached me.",
                "They refused refund even though I returned the product.",
                "The refund window is closed even though I initiated return.",
                "Platform says refund successful '97 but my account doesn't show it.",
                "I can't see any refund details in my order history.",
                "The app is not showing refund status clearly.",
                "I was forced to accept a credit note instead of cash refund.",
                "They issued refund to a wallet I never use.",
                "Refund tracking is confusing and doesn't work.",
                "Refund was cancelled after approval '97 without informing me.",
                "They say refund is initiated but no transaction ID is given.",
                "Every time I contact support, they promise but do nothing.",
                "I have proof of return but still no refund.",
                "My order got cancelled automatically, but no refund given.",
                "They are asking for bank details again and again.",
                "The amount was deducted twice and no refund for extra charge.",
                "I haven't received refund for my cancelled pre-order.",
                "Support keeps forwarding me to another team for refund.",
                "The refund amount is short by uc0u8377 500.",
                "I got a used phone, returned it, but no refund yet.",
                "I cancelled the order immediately, but refund was denied.",
                "Platform says refund successful but bank says otherwise.",
                "The order was rejected but refund not processed.",
                "They promised instant refund but nothing happened.",
                "Refund is taking too long despite reminders.",
                "The refund option is not working in the app.",
                "I'm being forced to take replacement instead of refund.",
                "They refused refund saying the issue is not valid.",
                "Status shows refunded but amount not reflected in my wallet.",
                "My refund was declined with no reason given.",
                "App says refund completed, customer support says pending.",
                "I raised a refund request but it's not even acknowledged.",
                "They keep asking for documents after refund approval.",
                "My refund is being held without explanation.",
                "No one is helping me get my refund for a defective phone.",
                "Even after escalation, refund hasn't been processed.",
                "I got the wrong product, returned it, still no refund.",
                "My refund was processed to the wrong UPI ID.",
                "I was told refund will take 5 days '97 it's been 20.",
                "They refunded me partially and closed the case.",
                "I was asked to return the phone first, but refund is still pending.",
                "I'm being told conflicting information about my refund.",
                "My refund timeline has passed and there's no update.",
                "They say refund was successful, but bank has no record.",
                "I got refund confirmation SMS but account shows nothing.",
                "The return happened on time, but no refund yet.",
                "I'm chasing support every day for my refund.",
                "Refund was promised after technician visit, never happened.",
                "Refund was approved, but now marked as failed.",
                "My refund request was auto-closed without resolution.",
                "I got a defective product and returned it, refund pending.",
                "I escalated refund issue, still no response.",
                "They've been saying 'it's under process' for 10 days.",
                "I cancelled due to delay, but no refund received.",
                "I received only shipping cost, not the product amount.",
                "My refund is split in two parts and only one was credited.",
                "They sent refund receipt but no actual transaction.",
                "Refund is showing under wrong order ID.",
                "I made COD return but refund is not coming to my UPI.",
                "The refund link was invalid after I clicked it.",
                "My refund case is marked resolved, but I didn't get it.",
                "I have all return proofs, yet refund denied.",
                "Refund failed due to technical error, no update since.",
                "They refuse refund due to damaged box, even for wrong item.",
                "I got charged again after refund was promised.",
                "They processed refund to a card I don't use anymore.",
                "The phone was returned successfully '97 refund missing.",
                "I returned within policy but refund denied.",
                "The refund helpline doesn't respond at all.",
                "I'm asked to wait for refund with no clear date.",
                "Refund processed in parts but still short of total.",
                "Customer care is clueless about refund details.",
                "The refund amount shown is incorrect.",
                "They say refund is done, but I never got any mail or credit.",
                "My account was debited but I never got the product or refund."
            ],
            "responses": [
                "refund issue"
            ]
        },
        {
            "tag": "replacement denial",
            "patterns": [
                "My phone had a broken screen on arrival but they refused to replace it.",
                "I applied for a replacement but the seller denied my request.",
                "Even though I reported the issue in 24 hours, they rejected the replacement.",
                "They said it's not eligible for replacement even though it was DOA.",
                "I got a damaged product but my replacement request was cancelled.",
                "Replacement was denied saying it was a minor defect.",
                "The phone has performance issues but they won't replace it.",
                "My phone won't switch on and still they are refusing replacement.",
                "They claim I damaged the phone and rejected my replacement.",
                "Seller refused to replace the product even though it's under return policy.",
                "Replacement window is still open but they denied my request.",
                "Customer service closed my replacement ticket without any resolution.",
                "They said the issue is not valid for replacement.",
                "Replacement request was auto-cancelled without informing me.",
                "The app says 'not eligible for replacement' without reason.",
                "I received a scratched phone but they won't replace it.",
                "Phone is heating abnormally and they denied replacement.",
                "They asked me to contact the brand for replacement '97 not seller.",
                "The replacement option disappeared from my app.",
                "They say phone was used so it can't be replaced.",
                "Phone reboots constantly but still not eligible for replacement.",
                "I placed a replacement request and it got rejected automatically.",
                "Seller says no stock so can't replace my faulty phone.",
                "They're asking me to repair the phone instead of replacing it.",
                "Even after technician visit confirmation, replacement was denied.",
                "My complaint was closed without action '97 no replacement given.",
                "I raised the request on time, but they still denied replacement.",
                "They say policy allows only one replacement, so mine was declined.",
                "I got a used phone and they refused to replace it.",
                "Phone doesn't charge, but they denied my replacement request.",
                "They closed my replacement request without any feedback.",
                "I was told to take it to a service center instead of getting a replacement.",
                "Despite having full warranty, they denied my replacement.",
                "Seller claimed it's not their responsibility to replace.",
                "They marked my phone as returned but no replacement was issued.",
                "I returned the faulty item but they didn't send a replacement.",
                "The product had scratches, but seller says no replacement allowed.",
                "Support team keeps stalling my replacement approval.",
                "They say once opened, the item can't be replaced.",
                "Product was delivered late and defective, still no replacement.",
                "They rejected my claim saying box was opened.",
                "Packaging was damaged, phone faulty '97 still denied replacement.",
                "They insist it's working fine '97 even though it clearly isn't.",
                "Courier confirmed damage during delivery but no replacement given.",
                "Replacement was accepted first, but later denied.",
                "They are saying it's past 7 days, but I raised request on 6th day.",
                "My issue was marked as resolved without replacement.",
                "I got a wrong model and they refused to replace it.",
                "Replacement was denied saying I didn't submit enough proof.",
                "They're asking for a video proof to approve replacement.",
                "Even with clear pictures, they refused to approve my request.",
                "The seller says policy doesn't allow replacement for this product.",
                "They told me to contact the courier instead of replacing the phone.",
                "Chat support ended my request saying 'out of policy'.",
                "I was promised a replacement on call, now they deny it.",
                "Support marked my request 'invalid complaint' '97 no replacement.",
                "They claimed misuse even though phone was used normally.",
                "The seller isn't accepting any replacement requests anymore.",
                "Phone had a manufacturing defect but they won't exchange it.",
                "They want me to go through brand even though it's just 2 days since delivery.",
                "My account shows no option to request a replacement.",
                "They cancelled my replacement and didn't give any reason.",
                "I received a non-functional phone and seller is not helping.",
                "They're refusing replacement because accessories are missing '97 but none were included.",
                "They are saying replacement not applicable for flash sale items.",
                "I received wrong color and they denied replacement.",
                "They said technician report was 'inconclusive' so no replacement.",
                "Replacement denied as phone was activated '97 how else would I test?",
                "Seller claims serial number mismatch '97 no replacement allowed.",
                "Return accepted but replacement not processed.",
                "They want me to return first but won't guarantee a replacement.",
                "They say 'once opened, can't be replaced' '97 this isn't mentioned anywhere.",
                "They say cosmetic damage is not enough for replacement.",
                "My request was stuck in review for days and then declined.",
                "They said it's eligible but still didn't replace.",
                "Seller rejected my replacement stating it's 'wear and tear'.",
                "They insist I visit store for replacement, but I bought online.",
                "The company said 'no technical issue', hence no replacement.",
                "They sent me a defective piece again and now refuse second replacement.",
                "They forced refund instead of replacement without asking me.",
                "They rejected my request due to 'missing box' '97 which I had.",
                "Phone was lagging badly but they didn't consider it for replacement.",
                "They told me to call brand helpline instead of replacing it.",
                "They refused replacement saying phone was 'fully functional'.",
                "No technician was assigned to verify the issue before denial.",
                "They keep citing return policy but won't process replacement.",
                "They said IMEI mismatch and rejected my claim.",
                "They accused me of damaging the phone intentionally.",
                "They refused replacement because I installed apps.",
                "They say fingerprint sensor issue isn't reason enough.",
                "Camera not working but no replacement allowed.",
                "Display flickers '97 they still denied my replacement request.",
                "I got an empty box but seller refuses to replace it.",
                "They rejected replacement claiming the seal was broken.",
                "They say policy doesn't apply since it's an offer item.",
                "I feel cheated as they promised replacement and now backed out."
            ],
            "responses": [
                "replacement denial"
            ]
        },
        {
            "tag": "screen/display issue",
            "patterns": [
                "My phone screen has started flickering suddenly.",
                "There's a green line on my phone display.",
                "The screen turns black randomly while I'm using the phone.",
                "I see patches or dead pixels on the display.",
                "My phone screen isn't responding to touch properly.",
                "After one week, the phone's display started glitching.",
                "There's screen bleeding near the edges.",
                "My display brightness keeps dropping automatically.",
                "Parts of the screen are unresponsive to touch.",
                "The display turns white when I open any app.",
                "There's discoloration on one side of the screen.",
                "Screen keeps freezing when I use the camera.",
                "My phone's touch sensitivity is completely off.",
                "The screen shows ghost touches '97 apps open automatically.",
                "The display shakes and jitters on scrolling.",
                "The screen has vertical lines after just 2 days of use.",
                "Display stops working during calls.",
                "The screen cracked during charging '97 no physical damage.",
                "The touch works only after multiple taps.",
                "The screen brightness keeps changing on its own.",
                "I see rainbow patterns when the screen is off.",
                "Screen doesn't wake up when I press the power button.",
                "My phone shows a blank screen after booting.",
                "Screen goes dim even with full brightness setting.",
                "Display randomly switches off during videos.",
                "The touch response is delayed and buggy.",
                "The top half of my screen doesn't work.",
                "Phone display flickers in low brightness mode.",
                "The screen flashes white and black continuously.",
                "I got a phone with scratches already on the screen.",
                "Colors on my display look faded and washed out.",
                "After unlocking, the screen stays black for a few seconds.",
                "My display becomes unresponsive after charging.",
                "There's a yellow tint on the screen out of the box.",
                "The screen shows mirror images of icons '97 ghosting.",
                "Videos lag due to display refresh issues.",
                "My display has random dots and lines after updates.",
                "Display turns pinkish after phone heats up.",
                "The display flickers at low battery.",
                "Display becomes unresponsive in cold temperatures.",
                "Scrolling causes screen tearing or jumping.",
                "My screen cracked during normal usage, no fall or impact.",
                "Display brightness flickers when switching apps.",
                "Icons appear blurry after restart.",
                "Colors seem off '97 whites look yellowish.",
                "Touch doesn't work while charging.",
                "Display doesn't rotate automatically anymore.",
                "Horizontal lines appear during video playback.",
                "My phone has screen burn-in after 2 weeks.",
                "Touch accuracy is terrible '97 especially near edges.",
                "Screen randomly activates without pressing anything.",
                "Cracked screen was delivered despite good packaging.",
                "Screen flashes when opening camera or flashlight.",
                "The display goes blank when typing for long.",
                "Touch doesn't respond when gaming.",
                "The screen gets stuck on one app and won't go back.",
                "Phone vibrates but nothing shows on the display.",
                "There's light leakage around the edges.",
                "My AMOLED screen shows weird colors in dark mode.",
                "Phone screen gets stuck while scrolling reels.",
                "Screen transitions are not smooth '97 stutter observed.",
                "The screen never turns off during calls even with proximity sensor on.",
                "My phone wakes up randomly with screen light.",
                "Phone screen flashes when plugging in charger.",
                "Even low brightness hurts the eyes due to flickering.",
                "My phone screen shows random icons overlapping.",
                "The notch alignment is messed up in full screen mode.",
                "My display gets stuck on lock screen randomly.",
                "The screen is not calibrated properly '97 everything looks stretched.",
                "Black levels are poor '97 looks grey in dark rooms.",
                "My phone has dead zones '97 touch doesn't work in parts.",
                "Touch lags when using multiple fingers.",
                "Screen looks dull and grainy compared to what was advertised.",
                "The display keeps flashing after dropping once.",
                "My screen broke in the pocket without pressure.",
                "Screen response is inconsistent and unpredictable.",
                "Display sensor behaves erratically in sunlight.",
                "The lower half of the screen doesn't light up.",
                "Phone display feels sticky '97 doesn't glide smoothly.",
                "Cracked screen came with the delivery '97 refused to replace.",
                "Images get pixelated when I zoom '97 display seems faulty.",
                "The phone has screen rotation problems after update.",
                "Screen flashes blue while opening settings.",
                "My phone screen shows shadowing behind icons.",
                "Screen vibrates visually when scrolling fast.",
                "Display switches off when using earphones.",
                "The screen goes dim while watching full screen videos.",
                "Device freezes completely when switching tabs.",
                "The phone gets stuck on boot logo '97 display not loading.",
                "My screen died just after one fall.",
                "Touch input is jittery and inconsistent.",
                "Half the screen is brighter than the rest.",
                "My new phone screen looks yellowish and blurry.",
                "Random light spots appear when screen is black.",
                "Vertical lines appear only when brightness is above 70%.",
                "My phone has a visible color shift when tilted.",
                "The edges of the screen look lifted and uneven.",
                "Display quality is far worse than advertised.",
                "The screen feels like it has pressure points built in.",
                "After unlocking, the screen jitters for a second.",
                "Apps are unclickable near the edges due to touch issues."
            ],
            "responses": [
                "screen/display issue"
            ]
        },
        {
            "tag": "seller unresponsive",
            "patterns": [
                "Seller is not responding to my messages or emails.",
                "I have raised multiple complaints but the seller hasn't replied.",
                "No one from the seller's side is getting back to me.",
                "The seller hasn't acknowledged my return request.",
                "I have contacted the seller repeatedly, but they are ignoring me.",
                "The seller is avoiding my calls and messages.",
                "There's complete silence from the seller even after escalation.",
                "I'm not getting any updates from the seller after placing my complaint.",
                "My emails to the seller have gone unanswered for over a week.",
                "The seller is not available on the chat anymore.",
                "I tried calling the seller, but the number is always unreachable.",
                "They haven't responded even after I sent proof of the issue.",
                "The seller has gone inactive after I reported the problem.",
                "The chat with the seller was disabled after I filed a complaint.",
                "Seller marked my issue as resolved without responding.",
                "Repeated follow-ups and still no response from the seller.",
                "Seller hasn't updated me on the replacement/refund status.",
                "I feel like I've been ghosted by the seller.",
                "The seller won't pick up my calls after product was delivered.",
                "Even the platform says seller isn't responding to complaints.",
                "I raised a complaint but no one from the seller's team got back.",
                "My return was approved but seller stopped replying.",
                "They aren't addressing my concerns at all.",
                "Seller is active online but refusing to reply to my issue.",
                "The seller has ignored my messages for 5 days straight.",
                "Seller closed my complaint without resolution or reply.",
                "There's no option to contact the seller anymore.",
                "I tried chatting and calling, but the seller ignores everything.",
                "The seller doesn't care about after-sales support.",
                "They promised a call back but never called.",
                "Seller won't explain why my refund hasn't been processed.",
                "They marked my return invalid without informing me.",
                "I sent evidence but seller isn't even acknowledging it.",
                "The seller hasn't shared any tracking or update since the return.",
                "They stopped replying as soon as I mentioned legal action.",
                "Seller only responded before purchase, now completely silent.",
                "Seller disabled the chat after I asked for a refund.",
                "They are online but won't reply to any of my queries.",
                "The seller is completely avoiding responsibility.",
                "Even after repeated nudges from the platform, seller hasn't responded.",
                "I raised a ticket 5 times and still nothing from the seller.",
                "They keep stalling me with no proper reply.",
                "I was promised a resolution but seller never responded.",
                "Seller not responding to replacement request.",
                "The seller's number is invalid or switched off.",
                "No contact has been made by the seller despite complaint.",
                "Seller blocked me after I raised the issue.",
                "They're not even trying to resolve the issue.",
                "Seller refuses to respond unless I remove my negative review.",
                "There is no escalation process for this unresponsive seller.",
                "They won't acknowledge the defective product I received.",
                "My complaint is pending because seller isn't cooperating.",
                "I tried reaching seller multiple times but they're not available.",
                "They haven't shared any pickup details or updates.",
                "No reply from seller even after a week of raising complaint.",
                "Even the support team says seller is not responding.",
                "The seller chat option vanished after delivery.",
                "Seller has ignored all my attempts to reach out.",
                "They ignored my request for help after delivering a damaged item.",
                "Seller won't even acknowledge the issue I raised.",
                "No one is answering my queries about the fake product.",
                "They replied once and then stopped responding.",
                "The seller is intentionally avoiding customer queries.",
                "They haven't responded to my order cancellation message.",
                "No one from seller side has confirmed refund process.",
                "My queries are being seen but not answered by the seller.",
                "Seller ignores everything unless I escalate.",
                "Seller is not responding to proof of return that I sent.",
                "They don't respond unless you tag them publicly.",
                "They are not interested in resolving customer issues.",
                "Seller hasn't addressed my complaint for 10 days.",
                "Seller has not initiated return pickup despite confirmation.",
                "The seller refuses to coordinate with the delivery agent.",
                "They ignore all refund follow-ups.",
                "No follow-up was provided by the seller.",
                "Seller said they would get back in 24 hours '97 it's been a week.",
                "I'm being ghosted by the seller after raising return.",
                "Seller denied my replacement and went unresponsive.",
                "They won't send any email or message confirmation.",
                "I can't reach the seller through any channel.",
                "Seller support is completely non-functional.",
                "They never called back despite promising multiple times.",
                "They stopped answering my calls after I asked for refund.",
                "I messaged every day and got zero response.",
                "They are ghosting me after the sale.",
                "They haven't responded on the app or email.",
                "The seller is not taking responsibility for the product.",
                "No resolution because seller is inactive.",
                "Seller marked issue as closed and now won't reply.",
                "No agent or representative from the seller has contacted me.",
                "They denied fault and went silent.",
                "Seller vanished after delivery confirmation.",
                "The seller never replied even after refund request was approved.",
                "They sent the wrong item and now aren't replying.",
                "Seller refuses to engage or provide explanation.",
                "Support says they can't do anything without seller response.",
                "Seller is inactive even during business hours.",
                "I was told seller would contact me '97 nothing happened."
            ],
            "responses": [
                "seller unresponsive"
            ]
        },
        {
            "tag": "warranty issue",
            "patterns": [
                "My phone is under warranty but the service center rejected repair.",
                "They denied my warranty claim without inspecting the phone.",
                "My screen cracked without impact but they say it's not covered under warranty.",
                "I was told my warranty expired, but I purchased the phone just 4 months ago.",
                "The company is refusing to honor the one-year warranty.",
                "I submitted my invoice but warranty was still rejected.",
                "They're saying physical damage when there is none '97 and rejected warranty.",
                "The phone is heating abnormally but they won't repair it under warranty.",
                "Warranty was denied because of a scratch on the phone.",
                "My charging port isn't working but they refused free repair.",
                "They're asking me to pay for repair even though it's within warranty.",
                "The warranty card is missing from the box.",
                "They claim water damage but my phone was never exposed to water.",
                "My device has a touch issue and they say it's not a warranty case.",
                "Warranty claim was rejected due to 'unauthorized software', which I never installed.",
                "The customer service closed my warranty claim without informing me.",
                "My power button is stuck and still they're denying warranty.",
                "The camera is blurry and they refused service under warranty.",
                "They say I need to prove the phone wasn't dropped '97 how is that possible?",
                "My fingerprint sensor stopped working, but they denied warranty support.",
                "Service center said screen issues are not covered under warranty.",
                "I got a DOA (dead on arrival) unit, but they're asking for repair fees.",
                "The warranty period is 1 year but they are calling it expired in 10 months.",
                "They're saying my purchase invoice is not valid for warranty.",
                "The company is refusing to accept the issue as a manufacturing defect.",
                "Warranty repair was promised in 5 days '97 it's been 2 weeks.",
                "They rejected my warranty claim citing 'customer misuse' without proof.",
                "My speaker stopped working but service denied it's a warranty issue.",
                "They say unauthorized accessories were used and voided warranty.",
                "Phone is in warranty but service team says it's not registered.",
                "I can't register my device on their warranty portal.",
                "Battery drains in 2 hours but they say battery isn't covered under warranty.",
                "Charging issue started in 2 months and they declined warranty.",
                "My warranty request is pending for over 15 days with no update.",
                "They say my warranty is region-specific and not valid in India.",
                "Warranty rejected because I didn't activate it online '97 wasn't informed.",
                "The repair team refuses to provide free service under warranty.",
                "They offered paid repair as the only option under warranty.",
                "My warranty claim was marked invalid for no clear reason.",
                "My phone has heating issues but service center won't accept it as warranty.",
                "They are delaying repair by saying part is unavailable '97 for weeks.",
                "My camera doesn't focus properly '97 not accepted as a warranty issue.",
                "Service center insists I pay for the motherboard under warranty.",
                "They claim the issue is due to voltage fluctuation '97 not covered under warranty.",
                "Service team said scratches void the entire warranty.",
                "I was told the display issue is my fault even though phone was never dropped.",
                "The phone's back panel is coming off but warranty is denied.",
                "They rejected the warranty saying the IMEI doesn't match.",
                "Warranty claim was accepted but now they're charging for shipping.",
                "Company says repair will take 30 days even under warranty.",
                "No replacement offered even though issue occurred within 7 days.",
                "Phone microphone not working '97 they said it's not under warranty.",
                "They say system issues are not part of warranty.",
                "I got a service center slip but they never repaired the phone.",
                "No response to my warranty claim emails or calls.",
                "They're asking for unboxing video to prove phone was defective '97 not fair.",
                "Support team says minor issues are not eligible for warranty.",
                "Phone was working fine but now won't turn on '97 denied warranty.",
                "The phone is rebooting automatically and they say it's software issue '97 not covered.",
                "My phone has ghost touch problem '97 not covered under warranty.",
                "No pickup service provided even though it's warranty repair.",
                "Warranty registration failed on their website and they deny coverage.",
                "Warranty denied because I missed the 7-day activation window.",
                "Display problem not repaired under warranty citing usage marks.",
                "I raised a complaint on the day of delivery '97 no warranty support offered.",
                "They say box mismatch is the reason for warranty void.",
                "Warranty team is not reachable and ticket auto-closes.",
                "They say online purchase warranty differs from offline '97 no logic.",
                "Screen started bleeding and they denied warranty replacement.",
                "The warranty center is asking for service fee upfront.",
                "They accepted the phone but haven't returned it after 3 weeks.",
                "They say root cause is unknown '97 so not covered under warranty.",
                "Customer support says file a new claim '97 old one expired automatically.",
                "I purchased extended warranty '97 they deny even basic support.",
                "The screen flickers constantly and still they denied warranty.",
                "They gave a refurbished part for my in-warranty replacement.",
                "They say I'm not eligible for warranty since I live in a rural area.",
                "They blame courier damage and won't honor warranty.",
                "The brand's service center doesn't accept third-party retailer invoices.",
                "They asked for cash payment even during warranty repair.",
                "My warranty claim was deleted from their system mysteriously.",
                "I got a warranty certificate but it was not accepted at service center.",
                "They keep sending auto-generated replies to warranty complaints.",
                "Service center says phone was physically opened '97 I didn't do it.",
                "They rejected warranty because the charger is third-party.",
                "There's corrosion on motherboard '97 but phone was never exposed to water.",
                "No engineer has visited even after warranty complaint was logged.",
                "They're asking me to cancel my warranty complaint and raise again.",
                "Support team asked me to share unboxing video to get warranty.",
                "They accepted the complaint but say 'delay due to part unavailability'.",
                "They refused to fix my earpiece issue under warranty.",
                "They accepted the phone and returned it without fixing '97 twice.",
                "Brand refuses to replace the phone despite continuous issues.",
                "Customer care says nothing can be done for warranty claim.",
                "They closed my complaint as resolved without fixing anything.",
                "I was asked to contact an external vendor for warranty service.",
                "Their app doesn't allow me to raise a warranty claim.",
                "They denied warranty because I bought from a different seller.",
                "They won't honor warranty since IMEI is not registered.",
                "I bought during sale but brand says 'not eligible for warranty'.",
                "They gave verbal warranty promise but now denying written proof."
            ],
            "responses": [
                "warranty issue"
            ]
        },
        {
            "tag": "camera issue",
            "patterns": [
                "My phone's camera suddenly stopped working after the latest software update and shows a black screen."
            ],
            "responses": [
                "camera issue"
            ]
        }
    ]
}